In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats

# import splitting and imputing functions
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

import os
import acquire
import env
import prepare

# 1: Attendance Date

In [2]:
tidy = acquire.get_tidy_attendance(acquire.get_connection)

In [3]:
tidy = prepare.prep_tidy(tidy)

In [4]:
tidy.head(1)
# a wide data set so i need to use melt

,name,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T

In [5]:
tidy = tidy.melt(id_vars = "name", var_name = "date", value_name = "attend")

In [6]:
tidy.head(5)

    name        date attend
0  Sally  2018-01-01      P
1   Jane  2018-01-01      A
2  Billy  2018-01-01      A
3   John  2018-01-01      P
4  Sally  2018-01-02      T

In [7]:
# half day is 50 percennt
# H = .5
# present = 1
# p = 1
# absent = zero
# a = 0
#tardie = 10/1
# t = .9
# mapping values to the attend column
tidy.attend.map({'P':1, 'H':.5, 'A':0, 'T':.9})

0     1.0
1     0.0
2     0.0
3     1.0
4     0.9
5     1.0
6     0.9
7     0.9
8     0.9
9     0.9
10    0.0
11    0.5
12    0.5
13    0.9
14    0.0
15    1.0
16    1.0
17    0.9
18    0.5
19    1.0
20    0.0
21    0.9
22    0.9
23    0.9
24    0.9
25    0.0
26    1.0
27    1.0
28    0.9
29    0.9
30    0.9
31    1.0
Name: attend, dtype: float64

In [8]:
tidy.attend = tidy.attend.map({'P':1, 'H':.5, 'A':0, 'T':.9})

In [9]:
tidy.head(5)

    name        date  attend
0  Sally  2018-01-01     1.0
1   Jane  2018-01-01     0.0
2  Billy  2018-01-01     0.0
3   John  2018-01-01     1.0
4  Sally  2018-01-02     0.9

In [10]:
tidy.groupby('name')['attend'].mean()

name
Billy    0.5250
Jane     0.6875
John     0.9125
Sally    0.7625
Name: attend, dtype: float64

# 2: Coffee Levels

In [ ]:
coffee = acquire.get_tidy_coffee(acquire.get_connection)

In [7]:
coffee.head(1)

   hour coffee_carafe  coffee_amount
0     8             x       0.816164

In [9]:
coffee_pivot = coffee.pivot( index = 'hour',columns = "coffee_carafe")

In [ ]:
# I would say that it makes it easier to track the coffee amount per coffee carafe

In [11]:
coffee_pivot.head()

              coffee_amount
coffee_carafe             x         y         z
hour
8                  0.816164  0.189297  0.999264
9                  0.451018  0.521502  0.915990
10                 0.843279  0.023163  0.144928
11                 0.335533  0.235529  0.311495
12                 0.898291  0.017009  0.771947

# 3: Cake Recipes

In [10]:
cake = acquire.get_tidy_cake(acquire.get_connection)

In [11]:
cake.head(5)

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084

In [12]:
cake[['recipe','position']] = cake['recipe:position'].str.split(":",expand = True)

In [22]:
cake = cake.drop(['recipe:position'],axis = 1)

In [23]:
cake.head(1)

         225        250       275        300 recipe position
0  61.738655  53.912627  74.41473  98.786784      a   bottom

In [44]:
cake.groupby('recipe').mean()

225    83.888258
250    78.564260
275    92.495638
300    78.708945
dtype: float64